fio-test/results/raizn_no_gc_write/64k-psync-1.out
job1: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=19961: Mon Sep  9 15:05:57 2024
  write: IOPS=27.6k, BW=1723MiB/s (1807MB/s)(673GiB/400005msec); 0 zone resets
    clat (usec): min=72, max=2920, avg=284.89, stdev=76.94
     lat (usec): min=73, max=2925, avg=287.82, stdev=77.35
    clat percentiles (usec):
     |  1.00th=[  186],  5.00th=[  198], 10.00th=[  204], 20.00th=[  215],
     | 30.00th=[  227], 40.00th=[  265], 50.00th=[  297], 60.00th=[  306],
     | 70.00th=[  314], 80.00th=[  322], 90.00th=[  355], 95.00th=[  400],
     | 99.00th=[  652], 99.50th=[  685], 99.90th=[  742], 99.95th=[  783],
     | 99.99th=[  889]
   bw (  MiB/s): min= 1309, max= 2600, per=100.00%, avg=1728.25, stdev=35.46, samples=6383
   iops        : min=20950, max=41609, avg=27649.60, stdev=567.34, samples=6383
  lat (usec)   : 100=0.01%, 250=37.38%, 500=60.89%, 750=1.63%, 1000=0.09%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.39%, sys=4.74%, ctx=11028565, majf=0, minf=136
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11028480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1723MiB/s (1807MB/s), 1723MiB/s-1723MiB/s (1807MB/s-1807MB/s), io=673GiB (723GB), run=400005-400005msec

Disk stats (read/write):
    dm-0: ios=48/11027329, merge=0/0, ticks=8/2967036, in_queue=2967044, util=100.00%, aggrios=22/4411493, aggrmerge=0/0, aggrticks=2/210264, aggrin_queue=210267, aggrutil=100.00%
  nvme1n2: ios=26/4411493, merge=0/0, ticks=8/208752, in_queue=208760, util=100.00%
  nvme4n2: ios=12/4411493, merge=0/0, ticks=1/210032, in_queue=210033, util=100.00%
  nvme0n2: ios=36/4411493, merge=0/0, ticks=2/208757, in_queue=208760, util=100.00%
  nvme3n2: ios=18/4411493, merge=0/0, ticks=1/211599, in_queue=211601, util=100.00%
  nvme2n2: ios=20/4411493, merge=0/0, ticks=2/212180, in_queue=212182, util=100.00%